lkolbly/cmsis-svd/data/Atmel/ATSAMDA0G15A.svd
        <register>
          <name>FCTRLB</name>
          <description>Recoverable Fault B Configuration</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SRC</name>
              <description>Fault B Source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SRCSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Fault input disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>MCEx (x=0,1) event input</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>Inverted MCEx (x=0,1) event input</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALTFAULT</name>
                  <description>Alternate fault (A or B) state at the end of the previous period</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEEP</name>
              <description>Fault B Keeper</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QUAL</name>
              <description>Fault B Qualification</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLANK</name>
              <description>Fault B Blanking Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>BLANKSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No blanking applied</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Blanking applied from rising edge of the output waveform</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Blanking applied from falling edge of the output waveform</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Blanking applied from each toggle of the output waveform</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESTART</name>
              <description>Fault B Restart</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HALT</name>
              <description>Fault B Halt Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>HALTSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Halt action disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW</name>
                  <description>Hardware halt action</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW</name>
                  <description>Software halt action</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NR</name>
                  <description>Non-recoverable fault</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSEL</name>
              <description>Fault B Capture Channel</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CHSELSelect</name>
                <enumeratedValue>
                  <name>CC0</name>
                  <description>Capture value stored in channel 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC1</name>
                  <description>Capture value stored in channel 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC2</name>
                  <description>Capture value stored in channel 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC3</name>
                  <description>Capture value stored in channel 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTURE</name>
              <description>Fault B Capture Action</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>CAPTURESelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No capture</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPT</name>
                  <description>Capture on fault</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTMIN</name>
                  <description>Minimum capture</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTMAX</name>
                  <description>Maximum capture</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCMIN</name>
                  <description>Minimum local detection</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCMAX</name>
                  <description>Maximum local detection</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DERIV0</name>
                  <description>Minimum and maximum local detection</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLANKVAL</name>
              <description>Fault B Blanking Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FILTERVAL</name>
              <description>Fault B Filter Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OVF</name>
              <description>Overflow Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG</name>
              <description>Retrigger Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNT</name>
              <description>Counter Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERR</name>
              <description>Error Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFS</name>
              <description>Non-Recoverable Debug Fault Interrupt Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAULTA</name>
              <description>Recoverable Fault A Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAULTB</name>
              <description>Recoverable Fault B Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAULT0</name>
              <description>Non-Recoverable Fault 0 Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAULT1</name>
              <description>Non-Recoverable Fault 1 Interrupt Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC0</name>
              <description>Match or Capture Channel 0 Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC1</name>
              <description>Match or Capture Channel 1 Interrupt Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC2</name>
              <description>Match or Capture Channel 2 Interrupt Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC3</name>
              <description>Match or Capture Channel 3 Interrupt Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OVF</name>
              <description>Overflow Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG</name>
              <description>Retrigger Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNT</name>
              <description>Counter Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERR</name>
              <description>Error Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFS</name>
              <description>Non-Recoverable Debug Fault Interrupt Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAULTA</name>
              <description>Recoverable Fault A Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAULTB</name>
              <description>Recoverable Fault B Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAULT0</name>
              <description>Non-Recoverable Fault 0 Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAULT1</name>
              <description>Non-Recoverable Fault 1 Interrupt Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC0</name>
              <description>Match or Capture Channel 0 Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC1</name>
              <description>Match or Capture Channel 1 Interrupt Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC2</name>
              <description>Match or Capture Channel 2 Interrupt Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC3</name>
              <description>Match or Capture Channel 3 Interrupt Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OVF</name>
              <description>Overflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG</name>
              <description>Retrigger</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNT</name>
              <description>Counter</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERR</name>
              <description>Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFS</name>
              <description>Non-Recoverable Debug Fault</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAULTA</name>
              <description>Recoverable Fault A</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAULTB</name>
              <description>Recoverable Fault B</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAULT0</name>
              <description>Non-Recoverable Fault 0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAULT1</name>
              <description>Non-Recoverable Fault 1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC0</name>
              <description>Match or Capture 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC1</name>
              <description>Match or Capture 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC2</name>
              <description>Match or Capture 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC3</name>
              <description>Match or Capture 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PATT</name>
          <description>Pattern</description>
          <addressOffset>0x38</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>PGE0</name>
              <description>Pattern Generator 0 Output Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGE1</name>
              <description>Pattern Generator 1 Output Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGE2</name>
              <description>Pattern Generator 2 Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGE3</name>
              <description>Pattern Generator 3 Output Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGE4</name>
              <description>Pattern Generator 4 Output Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGE5</name>
              <description>Pattern Generator 5 Output Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGE6</name>
              <description>Pattern Generator 6 Output Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGE7</name>
              <description>Pattern Generator 7 Output Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGV0</name>
              <description>Pattern Generator 0 Output Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGV1</name>
              <description>Pattern Generator 1 Output Value</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGV2</name>
              <description>Pattern Generator 2 Output Value</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGV3</name>
              <description>Pattern Generator 3 Output Value</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGV4</name>
              <description>Pattern Generator 4 Output Value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGV5</name>
              <description>Pattern Generator 5 Output Value</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGV6</name>
              <description>Pattern Generator 6 Output Value</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGV7</name>
              <description>Pattern Generator 7 Output Value</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
